{
    "data": [
        {
            "id": "d248f6f5-ca37-4467-a08d-11ad90fd9b1f",
            "text": "Marketing Events",
            "state": "closed",
            "distributionChannels": null,
            "user": "b6816cb5-cf05-433c-b07f-2ca3eea60f54",
            "owner": "b59ae96c-c132-4a91-9c5c-dccd88fc2794",
            "hiringManager": "6e6931c2-a7d7-4c68-9e24-d3950ae47180",
            "categories": {
                "commitment": "Full-time",
                "department": "Marketing",
                "level": null,
                "location": "San Francisco, CA",
                "team": "Brand",
                "allLocations": ["San Francisco, CA"]
            },
            "tags": [],
            "content": {
                "description": "\nLever was founded to tackle the most strategic challenge that companies face: how to recruit and hire top talent. We’re building the next generation of hiring software that companies like Netflix, Yelp, Cirque du Soleil, Shopify, and Eventbrite rely on to grow their teams. We've rethought the talent acquisition paradigm and are the innovation leaders in our space and looking for the right people to join us as we scale.\n\nTHE CHALLENGE \nAs Lever reimagines the role of recruiting software and the importance of a cohesive talent cloud, our ability to deliver highly impactful and strategic partnerships in the HR Tech space becomes imperative and front and center of our growth plans.  Lever customers love our seamless partner integrations and our ability to increase the number and quality of those partnerships is of the utmost importance.  We need a strategic thinker who is adept at engaging existing and prospective partners to deliver on ambitious revenue goals and to increase the partner offerings for Lever customers.  Additionally we need someone to work closely with our Sales, Marketing, and Success teams to ensure they understand and are trained to articulate the value of our current partner offerings. \n\nTHE OPPORTUNITY\nThis is a unique opportunity for a go-getter who is comfortable with navigating ambiguity and creating processes to scale a high-growth business through existing and future partnerships.  This is an opportunity to work across the entire Talent sector and to transform the way our customers think about HR Tech.  As a key contributor to Lever’s Partnerships and Alliances team, you will have a high degree of ownership to define your work streams and the strategic direction of the team.  You will work closely with the Director of Partnerships and Alliances, and leaders across Customer Success, Sales, Marketing, and Product to shape this immensely strategic function.\n\nTHE TEAM\nThe Partnerships and Alliances team is responsible for driving revenue growth through our partner ecosystem. We define strategic new business initiatives to grow our market segment share, and identify new product partnerships to extend the reach of Lever’s product suite. We deliver direct revenue to Lever’s Sales team through partner referrals and a revenue share model with our partners. This work is fast-paced and involves interacting with and influencing both external and internal stakeholders. \n",
                "descriptionHtml": "<div><br /></div><div>Lever was founded to tackle the most strategic challenge that companies face: how to recruit and hire top talent. We’re building the next generation of hiring software that companies like Netflix, Yelp, Cirque du Soleil, Shopify, and Eventbrite rely on to grow their teams. We've rethought the talent acquisition paradigm and are the innovation leaders in our space and looking for the right people to join us as we scale.</div><div><br /></div><div><span style=\"font-size:18px\">THE CHALLENGE </span></div><div>As Lever reimagines the role of recruiting software and the importance of a cohesive talent cloud, our ability to deliver highly impactful and strategic partnerships in the HR Tech space becomes imperative and front and center of our growth plans.  Lever customers love our seamless partner integrations and our ability to increase the number and quality of those partnerships is of the utmost importance.  We need a strategic thinker who is adept at engaging existing and prospective partners to deliver on ambitious revenue goals and to increase the partner offerings for Lever customers.  Additionally we need someone to work closely with our Sales, Marketing, and Success teams to ensure they understand and are trained to articulate the value of our current partner offerings. </div><div><br /></div><div><span style=\"font-size:18px\">THE OPPORTUNITY</span></div><div>This is a unique opportunity for a go-getter who is comfortable with navigating ambiguity and creating processes to scale a high-growth business through existing and future partnerships.  This is an opportunity to work across the entire Talent sector and to transform the way our customers think about HR Tech.  As a key contributor to Lever’s Partnerships and Alliances team, you will have a high degree of ownership to define your work streams and the strategic direction of the team.  You will work closely with the Director of Partnerships and Alliances, and leaders across Customer Success, Sales, Marketing, and Product to shape this immensely strategic function.</div><div><br /></div><div><span style=\"font-size:18px\">THE TEAM</span></div><div>The Partnerships and Alliances team is responsible for driving revenue growth through our partner ecosystem. We define strategic new business initiatives to grow our market segment share, and identify new product partnerships to extend the reach of Lever’s product suite. We deliver direct revenue to Lever’s Sales team through partner referrals and a revenue share model with our partners. This work is fast-paced and involves interacting with and influencing both external and internal stakeholders. </div>",
                "lists": [
                    {
                        "content": "<li>Strong partner/relationship management skills.  The ability to drive new business leads, revenue and sales through existing and future partnerships. </li><li>Strong, consistent experience in Partner Management in a high growth environment.</li><li>Strong presentation and communication skills with both internal and external stakeholders. </li><li>Can effectively collaborate with Sales, Customer Success, and Product to articulate the value of current and future partnerships and alliances. </li><li>Can leverage cross functional influence to gain buy-in and support for partnerships and alliances. </li>",
                        "text": "The Skill Set"
                    },
                    {
                        "content": "<li>Complete Ramp Camp, our comprehensive onboarding program designed to get you up to speed on all aspects of the business with a cross-functional cohort of new Leveroos. You'll learn about our business, product, vision and team and gain an understanding about how your role fits in to Lever's broader organization. </li><li>Dive into learning about the products in our talent acquisition suite - Lever Hire, Lever Nurture, and Lever Analytics - including the benefits they deliver and how we position them. Shadow sales calls to learn more about the product and how we position it to potential customers.  </li><li>Complete your starter project: Evaluate our partner tiering system and make recommendations on criteria, metrics, and process for engaging partners. Present your proposal at the end of your second week to your Ramp Camp class and our Director of Partnerships and Alliances.</li><li>Successfully complete demo certification on our core products so that you are fully equipped to demo Lever for existing and prospective partners.</li>",
                        "text": "WITHIN 1 MONTH, YOU'LL"
                    },
                    {
                        "content": "<li>Get up to speed on our existing partnerships and the competitive landscape by meeting with existing partners, reviewing industry reports, meeting regularly with our Marketing and Product teams and attending select conferences to deepen knowledge of our partner ecosystem. </li><li>Become the internal subject matter expert on existing partnerships. Direct Sales and Success colleagues to self-service resources (Guru, battle cards), and drive clarity on new partnerships that expand our ecosystem and strengthen Lever's value proposition.</li><li>Partner with internal stakeholders to build out a Partnerships demo environment and toolkit to showcase the Lever product suite and seamless partner integrations.</li><li>Develop a sustainable and repeatable process to follow up with the Sales team on the status of partner leads. </li><li>Work with Sales Operations to ensure all inbound partner leads are accurately routed to Sales for timely follow up and recommend steps to further streamline and automate the process.</li><li>Conduct initial meetings with 3 strategic partners to determine a baseline relationship.  This should include metrics and opportunities for increasing the value of those relationships. Determine how we will structure the partnership whether it be through lead sharing, sales territory mapping, co-marketing, or other initiatives. </li><li>Own regular business reviews and close partnership with 1 of our top strategic partners.  This includes bi-weekly or monthly calls to measure adoption/traction, share what’s working and what’s not, leading up to quarterly reviews.</li>",
                        "text": "WITHIN 3 MONTHS, YOU'LL"
                    },
                    {
                        "content": "<li>Establish recurring monthly sessions for new Leveroos to be introduced to our partnerships and alliances function, and a quarterly deep dive with sub-teams across Sales and Marketing.</li><li>Own monthly sync with Sales leaders for our customer segments and Marketing leaders to review areas of collaboration, future opportunity, and room for improvement.</li><li>Develop an annual Partnerships and Alliances calendar of events.  This should include recommended conferences and partner events to attend for maximum partner engagement, and partner lunch and learns to enable our partners to engage with Lever’s Sales and Success teams.</li><li>Alongside the Director, Partnerships and Alliances, work cross-functionally with Lever’s Sales and Marketing leaders to establish a framework and recommendations for executing on our partnership strategy.</li>",
                        "text": "WITHIN 6 MONTHS, YOU'LL"
                    },
                    {
                        "content": "<li>Work with the Director of Partnerships and Alliances to develop a 1 and 3-year plan for the function including recommendations for the partnerships marketing budget to help deliver on our revenue and other strategic goals.</li><li>Partner with Product and Marketing as we continue to build out a leading partner platform that delivers strong revenue generation, and builds a strategic advantage for the business.</li>",
                        "text": "WITHIN 12 MONTHS, YOU'LL"
                    }
                ],
                "closing": "THE LEVER STORY\nLever builds modern recruiting software for teams to source, interview, and hire top talent. Our team strives to set a new bar for enterprise software with modern, well-designed, real-time apps. We participated in Y Combinator in summer 2012, and since then have raised $73 million. As the applicant tracking system of choice for Netflix, Eventbrite, ClearSlide, change.org, and thousands more leading companies, Lever means you hire the best by hiring together.\n\nLever is an equal opportunity employer. We are committed to providing reasonable accommodations and will work with you to meet your needs. If you are a person with a disability and require assistance during the application process, please don’t hesitate to reach out! We celebrate our inclusive work environment and welcome members of all backgrounds and perspectives. Learn more about our team culture and commitment to diversity and inclusion. \n",
                "closingHtml": "<div><span style=\"font-size:13.5pt\">THE LEVER STORY</span></div><div>Lever builds modern recruiting software for teams to source, interview, and hire top talent. Our team strives to set a new bar for enterprise software with modern, well-designed, real-time apps. We participated in Y Combinator in summer 2012, and since then have raised $73 million. As the applicant tracking system of choice for Netflix, Eventbrite, ClearSlide, change.org, and thousands more leading companies, Lever means you hire the best by hiring together.</div><div><br /></div><div>Lever is an equal opportunity employer. We are committed to providing reasonable accommodations and will work with you to meet your needs. If you are a person with a disability and require assistance during the application process, please don’t hesitate to reach out! We celebrate our inclusive work environment and welcome members of all backgrounds and perspectives. <a href=\"https://inside.lever.co/\" class=\"postings-link\" rel=\"noopener noreferrer\">Learn more about our team culture and commitment to diversity and inclusion.</a> </div>"
            },
            "country": "US",
            "followers": ["b59ae96c-c132-4a91-9c5c-dccd88fc2794", "6e6931c2-a7d7-4c68-9e24-d3950ae47180"],
            "reqCode": "",
            "requisitionCodes": [],
            "urls": null,
            "confidentiality": "non-confidential",
            "createdAt": 1564617356565,
            "updatedAt": 1564617377166,
            "workplaceType": "unspecified"
        },
        {
            "id": "513d232d-2bfa-4120-a6d2-bf5fccbe0598",
            "text": "VP of Human Resources",
            "state": "internal",
            "distributionChannels": null,
            "user": null,
            "owner": "89f2a882-6600-41eb-b889-87d51f08e393",
            "hiringManager": "6e6931c2-a7d7-4c68-9e24-d3950ae47180",
            "categories": {
                "commitment": "Full-time",
                "department": "People",
                "level": null,
                "location": "San Francisco, CA",
                "team": "Human Resources",
                "allLocations": ["San Francisco, CA"]
            },
            "tags": [],
            "content": {
                "description": "The Staff VP Human Resources for Technology is responsible for HR human capital strategy that will drive the business to meet its goals within Anthem’s Technology and Digital teams. The role supports our Chief Information Officer and Chief Digital Officer and has overall responsibility for the people aspects of these two teams, and partners with HR stakeholders to create tailored talent strategies that enable the success of these teams. \n",
                "descriptionHtml": "<div><span style=\"font-size:13.3333px\">The </span><b style=\"font-size:13.3333px\">Staff VP Human Resources for Technology</b><span style=\"font-size:13.3333px\"> is responsible for HR human capital strategy that will drive the business to meet its goals within Anthem’s Technology and Digital teams. The role supports our Chief Information Officer and Chief Digital Officer and has overall responsibility for the people aspects of these two teams, and partners with HR stakeholders to create tailored talent strategies that enable the success of these teams. </span></div>",
                "lists": [
                    {
                        "content": "<li>Work closely with the business to evaluate and develop end to end human capital strategies and ensure proper integration and alignment to HR strategic goals.</li><li>Partner with business leadership in succession planning, leadership development/deployment and larger scale transformations in talent, both short term and medium term.</li><li>Provide insightful data to guide decision making and offer proactive solutions, solving problems and getting to the root cause and resolve issues.</li><li>Consult with leadership to create comprehensive people plans to influence lasting and sustainable efficiencies.</li><li>Provide decision support for business unit leaders and senior management teams operational and business goals.</li><li>Provide visible sponsorship and guidance for major change initiatives.</li><li>Hire, trains, coaches, counsels and evaluates performance of direct reports.</li>",
                        "text": "The primary duties may include, but are not limited to:"
                    },
                    {
                        "content": "<li>Requires a strategic thinker with the ability to develop and execute logical analysis to drive toward key decisions</li><li>Senior level HR operations and leadership experience</li><li>Acquisition and integration experience preferred</li><li>15+ years of progressive experience with significant large-scale project management, strategic planning and/or consulting in the health care industry or related large scale industry; or any combination of education and experience, which would provide an equivalent background</li><li>Demonstrated analytical skills, sense of curiosity, and effective problem solving</li><li>Ability to work through ambiguity, putting structure and “glide path” to broad enterprise initiatives</li><li>Proficiency evaluating market trends and building actionable strategy</li><li>Exceptional oral, written, and interpersonal communication, persuasion and negotiation skills required. Must be able to work across all levels of the company spanning from Board/CEO/Senior team leadership to front line-level audiences</li>",
                        "text": "PROFESSIONAL EXPERIENCE/EDUCATION:"
                    }
                ],
                "closing": "",
                "closingHtml": ""
            },
            "country": "US",
            "followers": [],
            "reqCode": "",
            "requisitionCodes": ["9900014"],
            "urls": {
                "list": "https://jobs.lever.co/nango",
                "show": "https://jobs.lever.co/nango/513d232d-2bfa-4120-a6d2-bf5fccbe0598",
                "apply": "https://jobs.lever.co/nango/513d232d-2bfa-4120-a6d2-bf5fccbe0598/apply"
            },
            "confidentiality": "non-confidential",
            "createdAt": 1563999827264,
            "updatedAt": 1565044419759,
            "workplaceType": "unspecified"
        }
    ],
    "hasNext": false
}
